tap "homebrew/bundle"
tap "homebrew/core"

# Miscellaneous
brew "chezmoi"
brew "fish"
brew "sqlite"
brew "tree"
{{- if eq .chezmoi.os "darwin" }}
brew "telnet"
brew "macvim"
{{- else }}
brew "vim"
{{- end }}
# Version Control
brew "git"
brew "glab"
brew "hub"
brew "pre-commit"
# JSON Manipulation
brew "jq"
brew "jo"
# Language Version Managers
brew "nvm"
brew "pyenv"
# Credential/Identity Management
brew "gnupg"
brew "keychain"
{{- if (and (eq .location "home") (eq .chezmoi.os "darwin")) }}
# Gaming
brew "openemu"
{{- end }}
